# CADLinkOptions Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CADLinkOptions Members
CADLinkOptions Class Constructors Methods Properties See Also
---
The CADLinkOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CADLinkOptions(CADLinkOptions) | Constructs a new copy of the input CADLinkOptions object. |
| CADLinkOptions(Boolean, ElementId) | Creates a CADLinkOptions object, specifying whether to preserve graphic overrides, and what view to use if the link's view has been deleted. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the CADLinkOptions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| PreserveOverrides | Whether Revit should preserve the link's graphic overrides on reload. |
| ViewId | The id of the view to use as the link's reference view, if the reference view has been deleted. |

# See Also
CADLinkOptions Class
Autodesk.Revit.DB Namespace